65536
196608
262144
4
5
6
7
8
9
10
11
12
13
32780
360459
229385
65553
65549
360467
65556
65559
23
25
32793
65564
32797
262175
65570
65571
98345
65579
65580
45
65583
393264
50
65587
51
32821
65592
32826
59
32828
360509
62
63
32827
32829
131138
65603
68
69
327749
196678
327752
65609
73
65610
75
196685
65614
65615
65616
81
65619
163923
196695
65624
65626
90
295004
360546
98
655461
65638
65639
104
65640
32876
109
111
65650
115
114
118
65655
32891
196733
65664
32899
65669
65670
136
137
32906
139
140
65675
295050
32912
65686
229528
32921
65694
160
196768
162
163
65702
167
166
65705
65707
172
65709
65710
65711
65712
177
65713
179
180
178
181
65719
426165
185
491704
65723
188
65726
194
195
393412
197
198
196
65732
65735
65738
262346
655562
131270
65742
199
204
209
65746
213
214
65752
65754
32988
65757
65756
223
224
393442
65763
65764
65765
230
360678
721124
65769
327914
262379
237
196845
239
164081
242
33012
65786
393466
65793
258
261
295174
98567
264
65801
263
360715
655627
360717
524562
524564
65815
280
281
262424
287
290
291
292
295
33063
65832
65834
299
295210
33069
302
305
306
393523
309
491829
311
310
313
295226
316
317
426306
65858
426318
335
336
337
339
340
491862
344
345
346
353
354
355
33124
356
491876
357
131429
426345
366
370
65908
65909
33142
373
33141
374
65910
65912
379
386
387
65925
390
391
392
389
394
65928
393
397
398
65935
360847
65937
399
403
491921
65940
65946
411
33178
415
418
419
420
33189
422
423
424
425
426
427
33195
197035
428
65959
65968
434
435
426419
436
438
439
440
98742
442
443
65980
33205
393662
393663
328129
328130
452
453
295366
33221
456
65993
33226
33229
688591
66000
66005
33237
295383
66009
475
476
66014
479
480
481
66017
478
33247
66022
490
66029
495
497
498
501
66039
33272
33273
506
360953
66042
507
66046
66052
66053
524
655884
529
535
66074
539
540
538
295451
541
33309
262686
393762
66076
66086
33321
556
557
262700
559
561
66098
563
66100
565
197174
66103
66102
33335
33330
66107
572
574
575
66111
577
579
581
583
584
585
229962
66119
588
589
98899
600
602
66139
33371
66144
612
66149
614
615
613
459369
619
620
621
622
623
624
625
626
66155
629
630
295542
66166
66171
33407
33409
33411
33412
647
648
649
650
651
652
361099
654
653
98957
459409
33424
98966
664
665
666
667
668
669
197277
688799
673
66211
33445
680
98990
557743
691
692
33461
696
393914
699
702
704
459456
711
66250
361167
197332
731
732
733
734
735
736
737
99036
426723
740
741
742
197347
744
745
746
747
361193
749
262893
752
754
131826
756
757
758
131832
761
762
760
361210
66304
770
779
66321
786
787
99092
623381
131862
33558
33560
793
788
795
295704
797
230173
99101
794
230177
33566
66342
807
810
426795
394028
812
426807
230200
197433
131898
99131
829
525119
832
66368
99138
33603
66372
33616
99152
164691
164692
853
66392
197468
328542
33631
33635
173
872
874
33646
394094
164720
881
883
884
885
394099
230263
66424
295801
66426
99191
66431
230273
99203
66436
33671
906
907
908
909
912
426896
33682
66451
66454
328602
66459
263069
928
929
557984
931
932
935
66471
33705
66474
937
936
66472
66473
942
944
941
426928
230323
66475
230325
99251
394169
66492
689086
960
961
33729
33732
99269
66502
969
971
972
974
33745
558033
979
33748
981
982
426967
984
989
33760
993
197601
997
1001
1002
1003
1004
1005
1014
1015
1016
99321
230392
197625
66556
66558
66565
132103
295946
394253
1039
33813
230421
1053
230430
33821
361502
66591
361506
99362
1060
361511
99373
263214
263215
263216
33842
263222
132151
394297
99395
33861
33862
33867
66635
164940
1100
66640
1115
33894
33895
66665
66666
33899
361578
394351
1136
525424
66674
66675
33908
296055
33912
33911
197752
1147
1155
1156
1161
99466
1163
197770
1166
33935
590993
1170
1172
427157
33945
1185
33954
1187
1193
230571
1197
1198
263343
1201
1207
33979
132283
361659
197823
492736
459969
197827
263363
394437
66766
66771
1240
263385
66779
132318
165089
230628
1254
1257
1258
1259
1262
1263
34035
230644
1271
1272
558327
1273
66812
34046
99587
1285
230661
1288
1289
1290
132361
1293
1294
1297
66833
1300
1301
1303
394520
34071
427287
99608
99610
1315
1316
1317
1319
427304
1321
99626
1320
1326
1327
427315
165173
1336
361791
1344
1345
34117
1350
1352
34120
1357
394575
1360
1361
1362
1363
34132
1365
1366
1367
1368
1364
1369
1371
1372
1373
1374
1375
1376
1377
1378
1379
1380
1381
263527
1386
1387
132458
1390
34158
1392
1393
1394
1395
1391
1397
34170
1402
1404
198013
492924
1409
1410
132483
1412
1413
1415
1416
198025
1417
427401
66956
1421
1424
1425
1426
1427
1428
1429
1430
1431
34194
198034
132506
1435
1436
198043
1438
66975
99744
329124
1444
1446
1445
34215
66985
1450
525739
34214
296356
1455
263600
34225
66995
1460
230835
230838
34229
1464
1463
1466
1467
1468
1469
1470
34237
34235
361927
296394
525771
1483
34254
34255
1489
34258
132563
132569
132578
1511
34281
394731
1518
361968
34289
34290
230899
34291
34292
394745
67066
296444
263676
263680
67075
1540
1541
132614
34312
99849
67084
1548
1551
1552
67089
1554
1553
1555
67093
1558
1559
1556
34329
67098
34331
1564
1565
1566
34332
34336
1569
1575
329255
1577
394792
1579
1580
230957
230951
1585
1587
230963
230964
1591
230969
1594
1595
230971
1596
1598
1599
1600
1603
1604
1605
1606
1607
67144
1609
1610
1608
34374
296521
67150
1618
362066
1619
1621
1620
1622
1625
493146
67163
460378
263773
1631
394848
656995
1636
1637
493157
67172
132712
231021
34415
1649
132724
165494
1658
394874
1660
67199
67200
1666
34438
296584
231050
1675
1676
1677
67215
1684
1686
394902
1688
34459
1692
34460
1694
1695
132767
1696
1697
362142
1699
1700
263845
1701
165543
231079
1698
1705
493228
657069
1711
1712
1713
1714
460463
34479
132789
1717
1718
34486
1720
1721
1722
1723
1724
1726
1727
1728
165561
1731
1732
1734
1736
1737
1738
67273
1742
1743
296656
1745
1746
67282
493268
132823
493272
67292
1757
1758
1759
1760
1761
34530
1763
34533
1765
1767
1768
1769
1770
132841
394988
67306
329454
67311
296686
1777
493294
34547
394995
394997
34551
1787
34556
427771
395006
1790
329471
67327
1794
296708
1800
395016
1804
132879
231184
231189
362263
1816
362267
34591
526112
362274
1827
1831
1832
1833
1834
1835
1836
1837
1838
1839
427824
1841
1840
1843
1844
1845
1846
1847
1848
1849
1850
1851
1852
1853
67384
1855
1856
1854
591682
1860
1866
1867
329548
296781
1868
1871
1872
1875
1878
34652
1885
34657
1890
1894
1895
1897
1899
1900
1901
1902
362351
34667
1906
1907
67442
1909
1910
1911
1912
67449
1914
100211
1916
1917
1913
460667
395133
264067
526212
100228
1926
526214
132999
1929
1930
1931
1932
1925
264069
1935
133008
1937
1938
1936
34708
1939
67478
264081
1944
1945
1946
1947
1948
1949
296861
1952
1954
1955
1957
1958
198567
1959
296872
395181
1966
1967
1968
1969
231346
1971
1972
1973
1974
1970
1976
34748
133053
1982
1983
1984
1988
1991
1992
1993
264138
100300
264141
2001
2002
133074
34769
362453
2006
2007
2008
231382
460763
264156
2013
2017
2018
2019
2020
2021
67559
2024
2023
34796
493548
2030
34801
2035
362486
100342
460794
2043
2044
2045
2046
2047
2048
2049
2050
2051
2052
2053
2054
67590
67584
2057
329737
2058
100363
2060
2062
2063
2064
2065
2066
2067
2068
2069
67605
2071
2070
2073
67606
2079
2080
2084
2086
2087
2088
67625
34856
133159
2089
133160
2090
34859
460848
264240
2098
67635
2099
264243
2103
2106
2107
2108
2109
2110
34874
133186
460866
2114
2115
2116
2117
2124
34893
67664
2128
2129
2131
2132
2133
34897
34902
165976
264284
2140
2141
788577
67683
2153
67689
2158
133231
34928
67696
67700
133238
2169
2170
133242
2173
2179
428164
2180
2182
2183
2181
460937
34949
297097
166025
2190
2191
2192
2193
2194
2195
2196
231567
34977
2210
2211
2212
2213
34981
34983
2217
559275
2223
2225
2226
67764
34997
166069
34999
2231
2234
2235
67772
67770
2236
2239
2237
755905
67777
133309
67778
35004
2238
166089
35018
35019
133325
2256
2257
2258
2259
35028
2261
2262
35030
35034
2267
2268
2269
35036
2271
428256
2273
2274
133343
35044
2272
35046
2279
231656
2280
2281
67816
2282
2284
2286
35052
2288
2289
2290
2283
2291
2293
2296
133376
461066
67851
133388
395534
2322
2323
2326
2327
2328
2329
2330
297243
166175
2336
67873
2337
559394
2340
2343
2344
2345
395563
2349
35118
2352
2353
756020
67896
2362
166205
133438
35133
133439
2370
35140
2373
2374
2375
2376
67912
2378
2379
395593
2380
100686
2377
2384
2385
2386
35148
2389
2390
67926
297304
65604
65605
100702
2401
2402
2404
2405
2406
2407
2408
428389
166250
2411
2412
2413
166249
2415
2416
2417
67952
2419
231796
330102
2423
2424
2422
67962
2426
297341
2433
2434
297345
35204
2437
2438
35207
2436
2441
2442
2443
2435
264582
330121
2447
35215
2449
2450
2451
2452
67989
2448
2455
2456
2457
2458
2459
2460
2461
625049
35231
264607
2465
2466
297377
2468
2469
2462
264613
2470
428459
2483
35253
330167
68025
2492
35261
2495
2496
2500
133572
2502
2503
2504
133585
592344
68057
68059
2524
395739
2526
2527
68062
2528
35294
2531
68065
2530
2529
395750
2536
2538
2539
68075
297454
68079
2544
2545
2546
2547
2548
2549
2550
100850
2552
2553
297464
2555
756219
2557
35326
2559
2562
2563
2564
2565
2566
2567
2568
68100
2570
2571
2572
2573
428558
2577
2578
2579
2580
2581
68119
2584
68124
297506
297510
2599
2602
2603
166442
2605
2606
461356
2608
2607
395826
2610
35380
2611
2614
2612
2616
264758
68152
657979
68153
2621
2622
2626
35395
2629
2630
2631
2632
35401
2633
100937
2636
363093
2647
264792
35418
2652
2656
2657
2658
35427
35426
166498
264803
2668
68205
2670
2673
2674
2675
2676
2678
428662
2679
2680
35450
363126
2685
166526
395902
2686
2689
2690
2691
2687
2694
395910
2696
2697
35465
625291
2702
2703
2704
2706
2707
2708
2709
2711
428696
2713
2714
2712
2717
2718
2720
2721
2724
35493
2725
2730
2731
2732
2735
2736
2737
2738
2739
2740
2741
2742
35507
2743
527032
2747
2748
35517
2750
35521
2758
2759
2760
2761
2762
199370
264909
592590
2773
35544
2780
35553
2786
2787
2788
2789
2790
2791
2792
2793
35555
2795
35562
232173
330473
35568
35570
2805
2806
2807
2808
2809
2810
2811
559867
461562
2814
2813
2812
2819
592644
2821
2822
2820
2824
2825
2826
2827
2828
2829
2830
68360
2832
2833
2834
2835
101140
2838
2840
2843
68379
2845
2846
2847
2848
2844
35617
199457
166687
559909
35616
35623
2856
2853
2852
2859
232231
101161
101158
2863
2864
199473
2865
2867
265012
2869
2870
68407
527159
2873
2874
2875
592699
494398
2884
756548
2886
35659
2891
2893
35662
2892
2896
2897
2898
199507
2900
2901
35670
2903
2904
2905
68442
35668
2908
68438
68446
2911
2912
101217
2913
2914
2916
199525
68454
2919
2920
2921
2922
35691
2924
68461
2925
2927
2928
2929
2930
2931
2926
2933
35702
2935
2932
2937
2938
2939
232316
35707
723838
2943
2944
428928
68480
2947
2946
2941
2953
68490
35721
2956
2958
2959
134031
2961
2962
2963
461714
363413
68508
2979
2980
2981
265130
35762
2994
68530
2997
134069
68535
2998
3001
3002
3003
3004
35774
232383
68544
3010
35780
3013
68549
3015
3016
363464
35783
3018
68555
35789
265168
3024
265170
3028
527316
68566
3029
527320
723928
3035
3036
101341
3037
134111
65733
35809
101346
101349
3046
3047
134121
3050
3051
68588
330733
3053
3054
3056
3055
297970
363507
363508
3060
3061
3062
35832
3065
527354
461819
3068
3070
3071
3072
3073
3074
3075
3076
3077
3078
3079
3080
3082
3083
3084
3085
232462
3087
3088
3089
101391
3097
3099
68636
3103
3106
3107
3108
101412
3110
3111
3112
363561
3114
3113
527402
3122
3126
3127
3128
3132
3134
3135
3136
363584
363592
3145
3146
3147
3148
35917
68686
3151
3152
3153
330834
363602
68688
3157
3158
3159
3160
101462
363609
3163
3164
363608
35925
3167
101472
68705
3170
101475
3172
3169
3173
3175
363624
3176
3177
3171
3179
68713
3174
3182
3183
68718
3180
298095
3190
3191
3192
68729
3194
3195
3196
363643
3198
3199
3200
3201
3202
396417
35972
68732
3203
3209
265354
3210
3211
560270
3215
560272
35985
3217
3216
35986
68758
3222
3224
3225
363673
232602
35992
3229
35996
3223
36000
3228
363682
36003
3237
3239
3243
265389
3249
36021
363702
36025
36028
167101
363710
298178
363716
36037
363719
36041
363722
265417
101588
298196
68823
3288
3289
363737
3291
3292
363741
3294
3295
3296
3297
3298
3293
3300
3301
3302
265441
3304
3305
3303
3309
3311
363761
3314
3316
36085
3319
363768
3323
3326
3327
3329
462082
3331
36103
36104
265480
363785
3349
101655
3353
3354
3355
363804
560413
68894
3356
560416
3357
36130
265507
331043
134437
3366
3368
363816
3370
3371
3369
3373
3374
363823
3375
363825
3376
3379
3380
3377
3382
3383
68920
3378
265527
36156
494909
363837
36159
363839
298304
298303
3397
3398
3399
3402
3404
3405
68942
3407
3408
363857
3409
691541
3418
3419
363868
3421
3422
3423
363872
3425
3424
363875
3427
3429
363877
3431
3432
101738
3436
101744
3445
3447
3448
3449
3452
363901
3454
3455
3453
3457
3458
3460
3461
68997
3463
3462
3465
3466
36229
232840
232845
36232
101766
36239
3473
36243
3476
3485
3486
3487
3489
3492
3496
3497
101802
363956
363957
691636
3512
3513
691642
363968
36292
69063
200137
3530
3531
3532
3533
3534
3535
3536
363984
69066
462293
69078
3543
3544
298457
265687
363995
363996
363997
134621
101855
101856
36319
3554
36323
36324
3557
462306
3559
3560
495080
36329
560615
396774
36330
3567
3568
36337
3569
3570
364017
364015
265712
364026
3579
3580
593403
364032
36354
36355
3587
3589
3590
593415
364040
560649
462346
3595
3591
3597
495113
3599
3604
3605
3606
3608
134680
3610
3609
3612
36380
3613
3615
3616
3617
3618
3619
3620
495141
364070
232992
364065
462382
36398
36400
364081
364083
3636
3637
134710
691766
3640
3641
3642
3643
3644
3645
298550
3647
757312
36418
3651
36420
3653
527940
3659
233035
298574
36430
527951
134738
3673
3674
36443
3675
3676
36445
3678
3679
3681
3682
3680
36449
560732
265822
527976
3688
3689
3690
331369
3691
3693
36460
364139
69238
3704
3705
36474
3708
3709
3710
3711
69250
739
265864
3721
3722
3723
3724
3725
3726
3727
429711
364177
3730
3728
396948
3733
3734
167573
3738
364187
3740
200349
200350
3743
69280
3745
3746
3747
3748
167589
69284
3750
691880
364196
3751
69294
3765
167608
3771
3776
3777
36549
134855
298696
265929
69320
364233
331465
200398
3791
364240
3790
200405
364245
3799
36568
3804
3805
3806
364254
200417
36580
3813
3814
102117
3812
3818
36588
3825
3826
3827
3828
364278
36599
36601
364282
69371
3839
69375
3841
3842
167683
364292
3845
3846
3843
3844
3848
3851
331532
102159
3856
429844
364308
364310
36630
134944
364321
364322
3875
3876
36645
3877
69415
462630
3881
298789
3879
3878
429869
36657
167732
3893
560950
3894
364343
36662
364346
69436
200508
200509
167743
364353
3908
3910
167756
3917
3918
364367
3920
69457
3922
3923
3921
3924
462678
3925
200536
36695
3928
200537
692054
364379
3926
3927
3935
36704
36706
3939
3941
364390
364391
3945
364394
3947
69481
462698
364398
135022
3952
3953
3954
3955
167799
69495
593789
36734
69503
3967
200575
102276
3977
3978
429963
36748
364425
364432
331665
3987
3988
364437
266134
102295
3991
3993
3994
102298
3996
266139
233373
69527
3995
364449
36768
4005
4007
4008
4009
364459
36780
4012
167854
364463
36784
36787
364473
4026
4029
4030
4031
659389
4033
528321
200644
36805
4038
4039
4040
4041
4042
36809
4044
4045
331727
4047
364497
4052
4053
364503
4057
4059
4060
4061
69612
4082
4083
4085
4087
4088
167930
4092
4095
4097
4099
430084
69640
36874
4109
69645
4111
200720
4117
4118
528410
4123
331804
364573
4127
4128
299039
4129
364580
4133
4136
4137
4138
135211
36905
102440
364590
364596
364598
4151
4150
364601
4154
4155
4157
36925
4159
331837
4161
364609
102468
4166
135239
462922
4170
4171
4173
4174
4175
4176
200778
4172
364627
4180
168021
4181
200789
462938
364644
4200
4201
4202
4203
4204
4206
135279
364656
4209
462960
69747
4212
4211
299126
4215
4216
331893
4218
4219
4220
299131
69758
266367
168064
4225
69762
430217
69775
37010
200853
4246
37016
69787
37020
233629
4254
4255
4256
233630
69793
364706
266395
430242
4262
168103
4264
4265
4266
364714
4271
4272
528562
135347
364722
4277
4278
4279
4282
37051
692413
4287
4288
364737
364738
233666
463043
4291
430279
4296
4297
4298
4299
364748
168140
659660
4300
364746
4306
37079
266456
4311
430302
364766
69858
4326
4327
37094
266472
37103
37106
4339
364786
4341
299254
4343
4348
4349
463101
4351
37117
4353
4354
266499
4360
4361
4362
4363
4364
69902
4367
4368
4369
4370
4371
69908
4373
4374
4372
4376
135442
266522
4379
4381
135453
4383
200989
37152
4386
4387
4388
4390
69928
4397
364849
4409
4410
4413
4414
4415
4417
4418
4419
627010
37190
4423
4422
4425
4426
266574
4431
4432
4433
4434
4435
364884
37203
4438
4439
4440
4441
4442
364890
4444
364892
4445
4443
364895
69990
364904
37239
102777
4475
4476
4481
4483
4484
4485
233859
364935
4489
70025
4491
4492
4495
4496
4497
4498
4499
4500
397716
4501
4503
4504
4507
4508
4509
37277
4511
4512
4513
233884
70051
364965
4518
4519
4517
4526
4529
4530
4534
364982
430520
4539
364988
4541
4542
4540
4544
4543
4546
4547
4548
4552
266697
430536
4554
4561
4562
365011
70100
102870
397783
37335
233945
430554
4573
4574
37350
4586
102893
4591
4592
102900
496119
4601
4603
4604
4605
4606
4607
627198
4609
4610
70140
37373
4608
4620
365068
299534
4627
365076
4629
4630
463383
299543
4632
397850
4635
4633
37406
102942
365087
135714
4642
70179
725542
4647
299563
37420
266796
365103
102962
37428
4662
4663
365112
365111
37434
496201
102986
4683
365131
332365
365134
365135
4682
4692
4693
70228
4695
4694
70230
135772
4704
4705
4706
4707
4709
37482
70252
4717
37484
4720
529008
4722
37499
103036
37504
4738
70275
4751
266896
103056
266898
37523
37524
103060
365208
4763
4764
266917
103081
37546
4779
365229
4781
365230
234162
4787
4786
168638
103107
4805
4806
365255
4812
4813
103118
365264
4818
4819
4820
4821
365268
37592
4825
4826
4827
299741
398047
37600
70368
365282
365283
4838
4839
365287
365286
4840
266984
4847
4848
4849
4851
299763
168694
365304
299769
332537
4859
135931
168700
365306
4858
4868
37637
37642
201483
37644
4877
4878
168719
4876
201489
4882
201491
4888
4889
37663
4896
365345
365348
365349
4903
4906
4907
4908
365359
4915
4916
70452
4923
70461
70462
201535
201536
332610
267074
70468
4933
4934
299844
365384
103249
103250
594770
267090
4949
201559
365401
4958
299871
627550
70499
267110
37738
4972
365420
365421
4973
365427
37749
365430
37751
4984
4985
168826
33555
37761
4994
70531
234374
4999
5000
70535
365448
5002
37768
37774
365455
5008
5009
234389
5017
37787
5021
234398
5022
5024
496542
5026
37797
5030
5031
70570
463791
5046
332727
5048
267191
234423
5058
5059
37830
5067
5068
660427
5071
5072
5073
5074
5075
5077
37847
5081
37850
70620
37853
37855
70625
234466
398307
37864
660458
103413
431094
70649
431099
365567
660479
5119
365571
70660
267270
37895
267273
5131
5132
5133
5134
5138
5139
300052
5140
5141
365591
5142
726034
5144
5145
562195
562200
5148
5146
5143
5152
5153
398371
168998
5166
5167
5168
332849
5170
5169
136244
37941
5177
5178
70713
5180
37949
5183
300097
5186
70722
5185
37959
365640
463945
431178
70728
5196
234575
37968
5200
5202
365651
5199
70736
5212
5220
5222
5226
70763
267375
5234
5235
5236
5237
38005
5239
5240
726137
5242
5241
5243
5245
234620
103551
234619
463998
38018
365699
5252
5251
529542
234631
726152
234633
5257
38023
365700
5254
332938
5268
5269
365718
300183
5272
38036
5274
234646
5276
5278
5279
38057
5290
5291
5289
5293
693422
5295
38064
5297
5296
38065
5300
5301
38069
5304
5312
365764
5316
5320
5321
431307
5324
5325
5323
5327
70864
38097
38098
5331
38101
5334
398550
5335
5337
70873
38106
5338
201948
5333
38112
267489
398561
5346
5347
5348
38116
365797
365799
398567
5353
5354
38123
5355
169189
38119
5359
5360
5361
70893
496883
5364
38131
5367
5368
431351
5371
103676
5374
5378
333059
5379
5381
234754
627976
5385
169225
300296
5389
70927
5391
365840
234768
38159
365844
5394
660757
267548
529694
234783
5408
726305
5410
5407
365856
234789
5414
169256
628010
5420
5421
5422
267564
496944
38192
5426
365874
5429
726325
5433
5434
70974
5441
398662
169287
5448
5454
5455
267599
5456
234835
5463
103770
5467
5470
5472
496993
5473
5475
5474
333154
5478
398695
497000
5481
5482
5483
5484
5485
38248
5491
5493
5496
5497
5498
5499
5500
365946
202113
38275
5514
5515
71052
267658
5518
5519
562576
234897
267660
5523
234905
38299
365981
5534
5535
5537
5538
5539
5540
5546
5550
5554
5555
5556
38327
202168
71096
366009
5563
5559
267710
464318
5570
71108
5573
5574
103878
5576
5577
5578
5579
38347
464330
38350
5575
366026
5586
234965
38358
38360
71135
38369
38371
366055
398831
71153
202226
202227
5619
5621
103929
5631
169471
366081
5634
5635
267780
38403
497152
5640
5641
628232
235022
5650
5657
431651
5670
38442
5678
235057
202291
693818
5691
5696
5698
5699
5700
38470
5703
5704
5705
5706
5707
366160
366161
5718
235095
5719
5721
5722
5723
5720
497245
5727
5728
5729
5730
5731
5732
5734
5735
5736
5737
5738
235116
5741
5742
5743
5744
5745
5746
5747
38513
5749
726645
366191
5753
5754
5755
5756
5757
5758
5759
5760
5761
5762
497278
5764
398981
464517
5765
5766
202375
431752
5770
5771
5772
5773
235145
267921
366226
5781
38551
5787
5788
366235
431774
5793
5794
5797
5798
5799
530087
5802
5803
5804
5805
38574
399021
5813
38581
5815
5816
235194
5819
5822
5824
71361
5825
71386
5853
5854
5857
71397
71398
136936
628457
71403
693997
5877
5878
5879
136951
5882
5884
5886
38654
38656
5888
38658
5893
5894
5895
5896
235270
5898
38667
5900
268050
169748
5909
71447
5912
5913
5914
5915
5916
5917
366365
366367
268062
136995
268068
5926
366374
5930
5931
5932
5933
5934
235311
5936
5937
137009
366382
202548
137012
366388
5942
5945
399161
71482
38715
5949
5952
38720
563010
71492
202568
71497
38730
38731
71498
137037
5967
5968
5969
5970
71509
5974
5975
497497
5978
366426
38749
694110
137055
38752
5984
5986
399203
5987
366438
5996
694125
366446
202607
6001
71538
399219
6004
71539
38774
6008
6009
399231
6017
432002
6020
6021
6022
137096
202634
6026
38800
6033
71568
268186
104347
6044
6045
6046
71583
202656
6047
71586
6050
6052
235428
366502
6055
38819
366507
366509
6064
71604
6069
6071
6072
6073
6074
6075
6076
38842
235450
38847
399296
38849
366530
137156
71620
6088
6089
71626
366539
137164
366538
268234
6093
333770
497623
71639
530393
399323
104412
6109
399324
6110
38876
366561
6115
6116
6117
6118
6119
366567
268265
6123
6124
71659
6126
6127
727029
366581
6135
6137
38906
137215
6145
71684
38917
104453
6151
6152
6153
71689
235524
71693
366610
71711
235556
366630
563238
399410
6195
6196
6197
6198
6199
6200
6201
235578
530491
530492
6208
6210
6211
366659
6215
71751
6217
6218
38986
6220
6216
268365
38995
6229
6230
38999
6234
202843
6236
39008
6246
170089
202863
39024
6258
202869
6263
39031
137337
6265
71800
366717
71805
432254
268416
6272
137346
71812
268420
39045
202887
366731
137356
39053
6288
39056
6289
366743
6299
6301
6302
432286
432287
366753
366752
235681
39076
235685
6311
6314
6315
6316
6317
6318
6319
6320
6321
6325
563382
39096
6329
39099
170171
6334
6335
39104
6337
6340
39109
235717
563396
39114
6354
6355
301268
71893
39126
399576
399578
399579
6365
6366
39135
71902
39144
301294
71919
235758
366833
334066
71922
268533
104693
334072
6397
6398
6399
6400
6403
170245
39173
366855
431125
39179
6416
497936
6418
71954
235794
39189
6422
39185
6424
6425
6426
6427
6419
6431
39204
366890
137515
137514
6449
6450
71987
6452
629045
6454
6455
6456
235832
137528
6459
6460
6461
39229
6463
6464
6465
39235
6468
137540
170310
39238
72006
137541
399692
6480
6482
6483
6484
39252
6486
72023
6488
6487
268634
39264
6497
72038
170343
6505
170351
301425
170354
235891
268659
72056
366969
366968
104828
366972
727423
399744
6529
6530
6531
6532
6533
6534
6535
39303
6537
6538
6539
498056
235910
498059
6543
6544
6545
6546
366995
6547
366023
399766
6551
6550
235929
6552
6555
6558
6559
39327
6561
72096
6560
268705
72102
6567
6568
72104
367018
39340
6574
39344
72112
235953
39347
6576
6581
367027
39351
6584
6585
6586
6587
6588
235963
39360
399809
170433
235969
6598
367046
72142
39375
6606
6607
170451
6617
367066
72155
367067
367068
72158
6622
6626
72162
6629
6630
72165
268779
367085
367086
72176
39413
236022
6655
334343
137739
6668
367117
367118
6672
6673
301586
399895
137755
39451
104989
39454
6686
6687
6689
39458
236067
6693
6694
6695
6697
367148
39469
72238
6706
367154
6708
6709
6713
6714
268859
6715
72251
6718
694844
6719
6720
6716
6717
170557
367172
72261
39494
6727
6728
6729
6730
72265
6732
6733
72268
6735
6736
268879
6738
399955
367180
105037
6734
72279
6744
6745
6743
301659
6751
6753
334434
6756
6757
6758
727655
6760
6759
6762
6763
367211
72306
72307
6772
203379
6784
6787
6788
6789
6790
6791
6792
6793
39558
170632
6796
6794
6800
39573
6807
39577
6809
432798
6818
236194
6820
6821
6824
39593
6825
6826
6828
6829
39598
334513
1359
105143
6842
6847
6848
6849
72386
72385
6852
268994
6854
6850
6856
6857
6858
39625
6861
6862
6863
170703
39629
72397
367320
39641
334552
6877
72414
662237
39649
334573
6894
367343
6898
170743
39671
6905
236283
6911
367361
6915
6916
6917
6918
6919
6920
6921
6922
6923
39687
367373
170761
72467
6932
6933
6934
236310
39704
6936
236314
6938
6940
563997
236318
236319
334618
72481
6946
367398
465705
269099
367404
334637
39727
236337
105268
105270
72502
138039
432951
236342
6969
138040
498493
498494
236353
6979
6980
105286
236362
367437
6994
6995
6996
39764
629588
6999
760664
7000
203606
7003
432987
7005
7006
72544
7014
7017
7018
7019
269166
367472
7025
7026
301940
301942
7031
7032
105335
72569
39799
7035
236411
7036
7038
7037
7033
7034
7041
7042
7043
7044
7045
7046
400263
236424
301956
367500
7052
367502
203662
7056
39826
138131
7060
236441
7066
334746
138141
498589
236445
7071
7072
7073
7070
367518
170911
170914
629670
138150
170921
7087
7088
302001
105392
465843
138159
7095
203706
7099
7100
7105
662467
7108
7109
662468
7111
302024
138185
7114
39882
7116
7118
7119
334799
236504
7130
7135
105442
72676
498661
7143
105452
170993
7153
7154
7155
7156
7157
105462
39925
7159
39928
7158
7160
7161
39930
302075
7162
400379
39934
7169
105474
138243
7168
7173
105478
39944
7179
7181
72718
7184
7187
7188
39955
7196
7197
72735
7200
367649
367648
7203
7204
7205
7206
39974
7208
39977
7209
7211
629796
302126
7217
7218
367667
433201
39985
367668
39991
7224
7225
367674
564280
39995
7228
7230
7231
40001
236610
7235
72772
7236
7238
7239
7240
72777
7242
7248
7249
40018
72785
433236
7252
7254
7253
498776
40027
728160
7267
40039
334952
7275
72813
728174
7280
302193
269427
72820
105587
7288
7289
367737
7291
7292
7293
138363
400506
7296
7304
138380
7315
7317
269463
7320
7321
7322
7323
7324
40087
236704
662691
72870
7335
7336
7337
7338
7341
7342
40112
105650
7347
7348
7349
7350
40117
7353
40122
7355
728251
7358
7362
236739
695494
40135
171208
7368
7371
7372
7373
138446
72914
7379
138452
72916
7381
7382
7380
236760
40147
498906
7387
302299
7388
695513
171230
269537
40161
335075
7398
7399
7400
138473
269546
7403
105707
7405
7406
7408
367857
7410
7412
72948
7414
7413
72950
40181
40186
367870
72961
105731
7431
7432
7433
7434
7435
7437
7438
7439
269584
40209
105741
40208
7440
7445
7446
40215
7448
7449
7447
40216
7452
138520
7450
7451
72988
138523
72990
7454
7456
7457
7458
7459
7460
40229
138534
269607
7464
40232
7462
367929
367930
7484
7485
367934
7486
367936
367935
7490
7491
367940
367941
662852
73031
105801
695626
7499
40275
400723
7509
695641
335194
40286
302438
7526
367976
40299
7533
7534
7535
7536
7537
335216
7538
367981
7542
728442
499067
7549
7550
7551
7552
7553
7554
269699
269696
7556
7557
236931
368008
40326
7562
7563
7564
7565
7566
368014
7568
7569
302482
7567
204178
40341
40346
7579
236959
236963
7589
7590
40358
204204
7596
7598
400818
7603
40376
204217
368058
7610
73148
40381
40382
368062
7616
7617
73152
7619
7620
7618
40389
236996
761288
73163
73166
7634
40403
7635
7637
7638
40405
466392
564699
7645
302557
40413
40418
695778
7656
7662
7666
7667
7668
7669
7670
7671
7672
7673
7674
7675
7676
7677
73213
7679
433664
368129
237050
7685
138757
7687
138760
7689
73227
40460
40459
7695
368147
40469
7704
761371
564763
7709
7710
400928
73249
368162
73250
7716
7717
204326
7718
7720
73254
7722
7719
40489
237095
40494
7721
663088
73264
7731
138803
532019
302649
433728
7746
7749
7750
40520
7755
204363
368208
7762
7763
269911
368215
7769
7770
7771
73309
7776
368226
106083
7778
7781
7782
7783
7784
7780
73316
204395
368235
7789
237165
99241
7785
73324
7795
7796
7799
171640
7801
40570
40571
7802
40573
7806
302717
7808
237187
368262
7819
40588
237197
335499
335500
7824
73361
7826
269973
7830
106142
73379
7844
368293
7846
269991
73384
7843
269993
7852
40620
401070
7857
7858
7861
7862
40629
40632
7865
7866
302779
7868
7869
7867
73403
7873
7874
7879
7880
368330
7882
7883
204493
7886
40654
40658
171731
73430
40664
728794
7899
7900
7903
40678
564966
73453
73456
73458
270067
40692
40697
204540
40703
40705
204546
40706
106242
7939
40710
7942
7944
7945
40714
7946
7943
7948
7954
7955
7956
40725
7957
40723
7960
7961
7962
270109
728863
728865
40741
401193
7981
368429
237358
106289
237362
7988
368438
40760
40762
7994
728890
7999
433985
368451
368454
663367
8008
8009
8010
368459
8012
368460
8015
8017
8018
204627
8020
8021
8022
401234
8019
401240
40795
8030
73567
565087
8031
8032
106339
8036
171875
8037
73566
73574
73577
8042
532330
8038
73575
237425
8055
8056
8057
40826
8059
302967
335739
532346
40830
8067
8068
8069
8070
368516
8071
40842
40844
73613
8077
8076
8080
8081
8082
270225
8084
8085
335765
8087
8089
565148
8093
8094
499614
8095
8097
8098
270242
335781
40873
8105
8107
40876
8112
204724
40885
8118
8120
8123
368572
40895
368575
73665
335808
8131
401347
8133
8134
368582
8136
303049
8138
8139
368589
466898
73686
532441
40922
565213
401374
73696
270305
8162
368611
466916
8164
40938
73708
73715
204795
73735
106505
532491
73739
40974
532495
40981
532505
532506
368674
565285
368680
368683
237614
172084
368699
73789
73790
499774
73792
172097
368709
41030
434252
73804
237645
73807
8270
41042
8275
73812
73813
8278
8279
73815
73817
73818
434266
401500
73821
237657
204897
8290
8289
532580
73829
204900
73832
73833
8296
41067
73836
237673
73842
73844
73847
73848
73849
73850
73851
8316
368764
532602
467071
73856
336000
73857
73858
73863
303243
73869
41102
8334
73872
73870
8339
8341
8343
8347
8349
303262
8351
8352
73889
368801
8355
8356
204964
696488
73897
73898
73900
8369
8371
303284
532660
73910
73907
401592
8376
401595
8380
73916
368830
401599
8384
499905
8385
73921
73923
368834
41158
172232
8395
73931
73932
401611
270543
8401
8402
73937
73939
106710
41175
106712
73943
73944
73948
73949
73952
8417
8419
237796
8420
8422
73955
73956
8421
368874
41194
73962
73966
41198
73968
237807
41202
368883
41204
73972
73975
270584
73979
729340
73981
270588
73982
73984
73985
106754
73987
368900
467202
73992
205065
73994
368907
8462
8463
8464
270608
74000
8467
8468
41232
74001
8471
8472
368919
74010
303385
8476
74013
303390
74011
8480
8481
74014
41251
205091
74022
368935
74023
172330
74027
74028
41259
434476
106799
8496
8497
8498
8499
74032
8501
74034
74039
631091
74042
8506
8507
74045
8510
8509
8512
237889
74044
74046
8517
41285
434503
500042
74059
8527
270674
74068
8533
41302
8535
8536
401751
8538
106842
8540
8541
41310
74076
74077
729438
8546
8549
8550
270696
8553
8554
74089
270701
74095
74096
74097
237938
41330
369007
74102
74104
369018
74108
565629
41342
729473
401796
74120
74122
74123
74124
74126
74127
74128
237969
106898
500115
74132
41365
41362
74133
336280
74138
41374
74142
74143
369057
74146
172447
369065
74154
74155
74156
369069
237998
74158
74159
631218
106934
41399
74167
74169
238010
106939
74172
41405
238014
74173
74174
74176
369088
336323
369092
238019
74182
41415
369096
74185
270791
74187
369091
74191
369109
8662
303573
41432
74198
8666
565723
74204
74201
74205
74207
8672
74209
74213
41446
238056
74216
270827
74220
74221
631276
336367
41458
74227
74230
8695
8694
8697
74234
74235
41468
401915
74239
500225
74242
74241
74243
74245
74246
74247
74248
238088
41478
8715
8716
74251
74250
369167
74256
238097
107026
41491
369171
74261
74259
74257
41499
8732
74268
74267
41503
74272
41505
41506
8737
8740
8741
8742
8738
8739
74280
500262
41515
74279
434728
8750
401967
41520
74289
74290
74291
401965
238133
74294
41527
74297
139838
41535
565824
74305
74304
336448
8769
8768
8767
8772
8776
8777
8778
8782
74320
369232
8786
565843
107090
8789
533078
8791
565845
8788
74330
74331
8794
565852
8793
74335
74334
41570
205411
74339
8805
41572
172642
74344
205416
8810
41581
74349
74351
74352
8817
107123
74356
369268
8821
369270
107128
74360
74361
41595
500347
270971
41598
500343
74368
74369
8833
8835
8832
41605
8837
664199
74376
41609
74378
107146
8836
8845
74382
107150
467600
74385
74386
74387
205458
41619
138530
270999
467603
74393
41627
74397
74400
8867
8868
8869
74406
8871
107174
664228
41642
74411
74409
74410
41639
74415
565928
500400
74418
107188
41653
74422
74423
107190
74425
74426
8891
402108
107197
74430
41663
74433
74434
8903
8904
8905
8906
8907
8908
8909
8910
8911
8912
271050
41682
74451
74450
74447
107222
107223
74448
41690
74461
74463
434912
74465
74466
729824
8933
8935
41707
74475
8940
8942
41713
41714
74481
74484
74485
74486
271093
74489
8953
74491
8955
8954
74494
41730
271108
41734
369415
8969
74507
74508
41742
41743
500496
467728
74510
107283
74514
8981
74517
8982
41745
41753
41754
74523
41756
74525
74526
74529
205603
336677
107303
74536
664359
9002
9003
271147
9005
402223
369456
74545
107314
369459
434996
74548
369463
271161
107321
74554
107324
9021
9022
500541
74553
238403
74566
402247
205640
238409
9033
74568
74572
74573
205646
402256
74576
9040
9043
729939
369492
369493
9047
74586
9051
9052
74589
369499
238431
205665
238439
369512
336746
9068
9069
402286
9070
9072
9071
74604
41841
238451
271223
336759
402297
9084
107391
9087
9092
664455
9097
304014
205711
74639
9105
9106
369553
41879
74649
271257
369565
74657
271266
107430
304039
172968
9129
402346
41899
205739
9132
271275
369583
74667
402351
107443
271284
74679
9146
9147
74683
9150
9151
74687
205758
304067
336841
500685
74702
9167
9171
435159
74715
369635
74729
9195
74732
402421
74749
566270
41983
435203
730118
74763
271372
271374
369680
238610
9235
107541
9238
9242
74782
107555
304168
74793
42026
9257
369710
369712
238644
369718
664630
205880
9273
9274
369721
205884
9282
9283
42056
369738
369740
271438
107599
238672
42065
74836
42075
74843
9309
369757
9308
9307
42083
205926
271463
74857
42091
42096
205941
9334
9335
9338
74875
107643
107646
9343
205950
533631
42112
9347
9349
205961
74898
74899
369812
74901
9366
74903
271512
238740
9374
74911
9376
238751
74915
205988
42148
42154
107692
42156
9392
140471
9400
369848
9402
9404
9410
9411
206021
369866
500939
369869
566479
9424
9425
9426
74969
9436
369884
9438
369885
9440
107747
369893
369894
9447
9448
9450
42219
9454
9455
42227
238838
369911
402683
369916
9472
369928
9484
402703
369935
42257
75027
369939
9493
9494
9491
304410
238874
664861
206111
9508
238887
238890
75050
369964
402736
75061
75071
75073
75074
369988
9544
9545
9546
271689
9547
402765
9551
75089
566610
9555
75092
9558
206169
9563
9565
533854
271711
533857
9571
370023
9575
271728
533874
9586
42358
9594
9596
75133
206205
271743
9600
402812
75138
206211
9604
107909
730502
9598
501128
75145
107914
533896
75148
75149
9615
533904
75151
9618
140690
9621
370074
206238
140704
75170
239011
370091
42412
370092
9645
665012
42423
370104
75192
75199
468420
9669
9670
75208
9679
107984
9681
9682
468434
9683
42454
42455
75230
42464
1927
9698
370148
42475
9711
501238
206326
9722
108033
9730
9731
9732
9733
665091
9735
9736
239112
42503
75273
42508
239116
9742
337423
42512
9743
9747
370195
9749
9750
9751
42518
9753
42523
9757
9758
9759
468509
9764
9765
9766
402985
9772
42541
9773
402990
75310
9778
9780
9781
236408
9784
370233
271930
304700
9789
42558
370240
435777
75331
75332
75333
42566
75334
42568
9803
9804
42571
42572
9805
206412
42577
9813
370261
140887
9816
9817
9818
9819
42583
75353
75358
75359
75360
9822
42589
8466
9828
9829
9830
42595
75369
370283
206444
75374
42607
9840
9841
9842
665209
9849
9853
9855
9856
304768
403074
9860
403078
9863
8473
8474
9869
9870
9871
9872
239246
75410
9876
75412
75413
75415
75414
108185
75418
67092
1965
9888
239265
75429
468645
9895
9896
9897
9898
9899
239276
9900
9902
9903
9901
9907
9908
9909
9910
9911
9912
9913
75449
403131
9917
9918
99665
9923
9924
75461
9925
9927
42698
9931
75469
730829
9935
9937
239313
75476
75477
75478
9943
141017
9946
9947
272092
42713
730848
141026
9955
9956
9957
108262
42728
42729
239338
42731
9964
403181
75503
9967
403185
236446
534259
9974
9975
108279
9978
9979
42747
9982
9984
9985
9989
665350
534279
9991
403209
42763
108300
9997
75535
304912
10001
10002
534291
10004
403222
10006
10007
10009
10011
10012
10014
10015
10016
10017
108322
10018
10020
304931
436005
75557
75558
534316
10029
272174
272175
337714
436019
10040
370493
468801
42819
108361
272208
436054
370518
436056
42841
436057
10074
10076
403293
42846
108383
10075
10077
468831
370529
239460
10085
41081
272240
206704
42866
370546
75632
10101
10097
75639
206712
272250
239488
206722
75656
10125
10126
10131
10133
141211
10139
206751
10143
272289
206752
10149
10152
75689
10154
10155
42926
10159
10160
10161
10162
141231
174008
10170
10171
10172
75708
10174
403389
10178
10179
10180
10182
10183
10184
42958
10193
10194
567251
10200
10201
10203
10205
10206
42975
10207
206813
10213
42985
403433
370667
272364
10230
141302
272378
10237
10238
239615
10240
10241
10243
10244
10245
174083
141319
43016
10250
10251
10252
43019
10255
43025
10258
10259
43027
698386
10260
75799
10257
141337
75803
75804
43036
10271
10274
10275
10276
10277
75813
10279
75816
75814
239657
10283
731172
141358
10287
370734
501808
75832
43070
10304
10307
10308
43077
731206
141382
10309
10315
305228
141391
10322
501842
370770
141397
141394
10330
370782
10336
75875
370790
10342
10344
10345
141415
10343
174186
43111
141414
43121
10354
10355
10356
10357
10362
305275
10364
10365
174204
43136
43139
141444
10375
239752
10376
10377
403595
75917
370830
10383
239759
10385
75922
43158
75928
108698
239770
207002
75933
698526
10398
10405
403621
239791
10416
239792
174255
75955
10428
10430
10432
370880
174272
239811
174277
436425
141516
403666
370899
10454
10457
43225
10464
10465
10468
272624
469234
272627
272632
108794
174340
502022
76046
731407
731408
10513
239891
239896
239897
10520
338203
43293
633117
10527
403745
403746
76068
10533
207143
10536
239913
403751
76081
108849
43313
10548
10549
10545
370999
76087
174396
10559
76099
239939
43333
76101
10567
76106
502090
10572
76109
436563
10582
10586
174426
436572
43357
10589
403807
10593
10594
239971
10596
43368
141673
43369
207211
10602
403821
141676
76142
10608
43377
10609
338292
43384
43386
436604
43389
76157
10624
10626
10627
469379
76163
10634
43403
698766
10644
666007
10652
10653
371101
76191
43423
76193
666023
43438
534961
10674
10675
10676
436661
76209
10673
10682
76220
10688
108993
272834
10695
76234
76235
43471
502233
109018
10713
10719
535010
10722
272868
10726
698855
141802
10731
76267
10732
76270
10737
272881
10744
10745
10746
436729
10748
76283
10751
43520
10755
10758
141831
469513
10763
10764
10765
10766
10767
76305
207385
207389
10788
10789
436775
10793
10794
43561
10795
10797
10798
10799
43568
731697
10802
10804
43573
371252
10807
76344
109112
10810
10809
10808
731707
10820
10821
10822
535113
10828
436813
436814
371280
76371
10835
240214
371287
10840
10844
10845
76381
10849
10850
43617
76388
174695
371305
404074
10859
10860
10861
567916
43634
43636
535159
141944
273015
371322
76410
338556
273018
76416
76417
371332
10888
10889
305800
10891
240269
109199
10896
10897
76434
43665
10895
10906
305819
141979
10909
10910
371359
10912
404131
10916
10918
10919
10920
43693
10927
43697
240306
10932
404156
10941
10943
10944
43711
371409
10963
10965
10967
76509
174814
10979
10980
10984
10987
10988
76523
10991
10993
10994
10995
338673
10998
338680
11001
371454
404224
731904
273154
11012
11013
76550
11014
11018
11019
11020
142092
273167
11029
11031
11032
11033
11036
11037
11041
207650
142116
240430
11056
109363
371507
76600
469818
76602
633660
76604
174921
109389
142165
240472
76634
240477
142177
11108
240484
502632
469868
535407
76656
76657
502642
240500
371573
43893
43896
109435
11134
11135
11136
11137
43905
43903
43902
76679
11145
43915
43916
338832
600979
76694
11159
11158
76700
109475
11176
11177
11178
11179
109484
43949
11182
11183
11184
11185
11186
11187
338871
109496
76730
142266
11196
11197
11203
11204
207811
142275
11207
273352
306121
11210
11213
76752
142296
76761
142298
142306
44003
437219
240617
338922
437227
142316
142320
175089
240629
11255
11257
11258
11259
11261
11262
11263
11264
502785
11266
334396
11268
306182
11274
371722
11276
142349
44042
306187
11280
11277
11282
11283
11286
142361
44062
44063
11296
76835
44070
76839
11305
404522
109611
44074
109610
11310
11311
404526
404528
11313
109614
44084
11318
11319
11320
11321
11324
437310
44096
11331
11332
11334
11335
306248
470090
273483
11341
109646
142414
142413
502865
437330
44116
11349
11350
44117
11352
11351
470105
11355
142430
11358
207967
44128
207970
404580
76901
437350
207975
273509
175209
306287
44144
76914
175222
470135
11386
11387
11388
11389
11390
175228
11392
11397
11398
11399
11400
404617
371857
109714
11415
240792
44189
11422
11423
44191
11425
765089
11426
11424
371877
240806
76967
175271
11433
11435
132531
437426
44213
175290
273597
175294
11455
273600
11456
109759
470211
8790
175299
11468
11471
11472
142544
11473
11476
109784
44249
77016
11485
44254
109791
11489
437478
11498
11499
11500
437484
11503
11504
11511
11512
11515
273661
11518
11522
44292
11525
11528
109834
404749
44306
273683
11539
77076
77075
44307
77081
11546
11547
371993
77086
208163
44328
11565
44336
77106
44341
404792
535879
11592
470349
273745
11605
339289
11626
11628
44397
11630
11631
175471
11633
273778
11638
77178
44416
77189
11658
11661
11662
241039
175503
241040
11666
273813
77209
11681
77219
11684
11686
77223
44456
11689
11688
175531
273831
77232
77233
11698
11706
11707
8840
732606
11710
11712
142789
67459
11729
11734
44503
208343
77274
8846
404961
110050
21873
11748
11749
110057
44523
208368
11761
11762
11767
11769
77306
11772
11773
77309
11775
11776
11777
175618
142850
372227
273922
699917
11790
273939
11795
11803
208412
437792
77347
699942
77350
306727
241199
306735
77362
11828
536124
77373
11842
306755
11844
11845
208454
372296
44616
11852
44631
11865
44635
372316
11869
11870
241247
274015
77407
306786
110180
11877
110183
11880
11881
241257
11884
11885
11886
274031
700017
11890
11891
339572
77428
405111
11896
74006
11895
11898
11907
306820
274052
405123
11908
11912
274060
601741
44691
274069
405141
77466
372381
77469
241312
11947
77485
241326
44720
11956
241332
241333
11958
44730
208571
208572
11963
274107
700093
11966
503483
700092
11969
11970
11971
11972
208575
11976
732877
208595
601822
536287
241386
110315
110316
339694
12029
12034
12035
12036
241411
12038
77574
601863
12044
44817
12050
12051
44825
12063
12064
175904
12068
438053
77607
44845
470831
12080
175921
12082
12083
110388
77621
12088
12089
307002
12090
700220
143166
44863
44862
470851
634693
12102
175943
77642
12106
12108
12110
12111
12112
241488
12114
12115
12117
405334
12118
12119
12120
12121
12122
12123
143195
77658
44894
143198
44889
470881
110436
44901
12132
44909
601968
143219
12147
12153
12154
110460
12157
274303
77697
12161
12164
12165
12166
110471
143240
110473
176005
503686
77708
405388
372619
372623
372627
208789
143258
339875
339878
77735
12200
307115
44972
176065
176066
12227
667589
339911
45000
700360
405450
569297
12242
12248
12250
307162
110556
307163
12259
372708
405480
45034
307182
274415
367161
2440
45046
208891
77823
503815
77836
438285
372751
77839
372754
241688
569368
45083
77851
438301
405534
602143
77860
307238
77862
405546
77867
241708
372788
12344
12345
12346
12347
12349
12351
569407
12352
274502
12362
12363
536652
12366
12371
12372
241751
77911
12378
12379
12380
12381
12382
12383
372830
12384
12385
12387
12388
569436
12390
12391
12389
307296
372842
12395
700519
503914
45167
12400
12404
12405
45172
12408
45177
12409
45176
12410
12415
12419
12420
12421
77958
438407
12426
45198
340111
340114
372884
45205
12440
12452
12454
45222
438441
274601
12462
45234
45243
241852
12479
307391
12480
12484
307397
12486
372935
12487
35048
12497
12496
274640
12502
12503
45272
12505
12506
12507
12508
12509
12510
12511
307425
12514
12516
78052
12518
307441
12532
12534
110839
45304
12538
45308
12541
12542
269522
372993
110851
176390
12550
12551
12552
12553
12554
12555
12556
12557
373003
12559
12564
307480
12570
12572
274722
12580
471334
12582
307497
12588
471340
45369
12607
45376
12608
143680
405839
536911
12625
12634
471398
209260
78189
12654
45423
12655
307567
12658
45432
12665
340356
45445
274823
274834
340370
78228
236987
12694
12695
41600
12697
12698
12699
471452
12703
12704
12705
12706
12707
12708
45476
41603
12713
12715
45489
12723
12724
12726
45498
528030
12733
12738
242115
12739
12742
340424
78281
12744
12747
45514
12759
12761
78298
78299
471515
78307
12779
12783
111088
12786
78324
438773
12792
12793
12795
12796
12797
242173
373247
12800
12801
12802
12799
12804
143877
12806
12809
12810
45577
406030
12815
45589
373269
406045
12831
242208
12835
12838
12839
12840
12841
12842
12845
12849
111156
111158
78393
12861
12864
373315
45638
12872
406089
12873
275023
111184
537168
111185
668244
635476
242286
12913
373362
373363
45689
12926
78464
12928
12933
471685
78472
45706
78478
307857
307859
111254
340631
406170
12954
111258
307869
45728
12961
12962
12963
406181
12967
12969
12970
78507
12972
12973
12974
242350
12977
12978
504499
45745
504501
78518
35146
45757
307907
78537
13002
13001
373458
307923
45782
13016
13018
340701
373470
340702
242407
13034
406251
13037
13038
13039
13041
13042
242418
13053
45822
13056
45826
13059
406278
78599
45833
537358
13073
144147
13077
635674
602907
13084
373533
733982
13087
13085
13089
13090
13091
78629
74244
13096
13102
340784
13106
13107
701237
504636
406333
13119
13120
439106
406341
13127
2609
13129
176969
78673
13138
78674
13140
78677
340824
13146
13147
13148
45916
373599
13152
13153
602978
13155
734054
13162
13164
13166
177008
242545
13169
13171
13172
340848
13177
13179
45950
504705
603015
504712
13191
13195
308113
504722
13203
13211
45979
13213
242590
373661
177053
668577
275362
13220
74270
13227
504749
13229
13234
13235
13240
78777
46012
275390
144318
46019
13253
13255
13257
13264
209875
46036
13271
78809
13276
570333
13281
13282
13284
78824
13291
367364
13297
367365
13299
13300
13301
13302
13303
78840
78833
13306
13308
13311
78850
275460
472068
177158
144399
13330
472083
373780
177175
13336
13339
144413
13342
13343
46110
144415
13352
406574
177200
504880
13362
13365
13367
13368
13369
13374
78912
13377
78913
78915
78914
13378
13376
46150
13384
341062
13386
78927
13393
13394
13395
13396
13398
13403
13404
13405
13406
13408
406625
13411
13413
406630
341095
100360
406642
78963
13428
373876
13433
734330
13435
13436
13437
13438
13439
242816
406650
13440
13443
13445
13446
13448
46216
504979
13463
504985
275612
13472
341152
13475
79015
74321
79016
13483
46253
13485
13488
505009
439474
79031
505015
13499
13501
13502
13504
13505
67814
275654
13512
406729
79049
13518
79054
406735
373966
406746
79066
13538
13540
13542
505067
79086
13553
13559
144631
79103
13568
144642
46341
46344
374025
374026
13578
767242
13582
439570
13586
13588
13589
13593
275741
13599
13600
13601
13604
13605
13607
13608
13614
505135
79152
13619
13620
13624
13625
13626
79161
13632
13633
13634
13635
13639
13640
13641
13642
13643
79180
79176
79182
79181
13653
13656
13658
13659
13660
13661
13663
13664
308576
46434
13667
505185
13669
13670
13671
13672
275808
13675
13678
111985
341361
13684
13686
13690
13691
636283
13692
13693
13697
308610
46467
669059
210308
472455
13707
13708
13709
144785
46484
374170
13726
13727
13732
13733
13734
13735
13736
13737
79284
13754
308667
13755
13758
13759
13762
13764
46534
13770
13771
144843
13775
13776
13779
13780
13781
13782
13783
13784
13785
79321
13787
13788
243164
13790
13793
13794
144869
13798
275942
13801
13804
13805
13806
308729
13821
13822
13823
13824
669183
13827
308741
341512
734730
144906
13836
13843
13844
13851
46620
13853
46621
13852
177691
407067
13858
669213
13863
79400
13865
243239
243244
374317
210482
13874
13878
13880
13881
13882
13883
13884
13885
13888
13889
13890
13892
13893
13894
46669
439885
13904
13905
13906
46675
210515
46684
13916
13921
13922
144994
13928
13929
79467
177772
177774
210548
112245
13941
79483
145020
13949
46718
210559
243329
13956
13957
13958
13960
13961
13962
79499
79496
210576
46739
79509
276119
439959
13977
13979
112285
13987
46755
13988
14000
505523
14005
145078
112325
734918
14023
14026
767699
14042
14043
636636
145115
341726
145118
308961
46818
145121
14053
14054
79592
79596
767728
177904
308977
603891
374520
46843
177915
308990
145152
177920
46850
14084
14085
74442
14093
14096
112401
243474
243475
341780
79632
14102
669463
14109
14110
571167
14112
46881
14113
276253
14116
14117
14118
14119
14111
14122
14127
14128
14129
374578
276274
702261
14134
46903
14148
79684
46918
702278
14153
472905
636745
14157
341837
79694
14162
14163
46930
14166
14167
14170
14171
14172
14173
14174
14175
440157
79713
14179
14180
14182
243561
14185
276332
14189
46958
14193
14194
14195
14196
669556
14200
14201
145272
14205
46977
14213
14214
14215
14216
14217
112521
14219
14220
46988
145291
178063
407434
374673
407447
14232
79772
14237
14239
407461
14246
14247
14248
14254
341936
47025
14256
47028
145333
14269
14270
14274
14275
14276
14281
145353
14283
14284
112591
14288
14289
14292
14293
14296
473049
112606
309214
14306
14318
14320
145394
243698
374777
14331
407551
47107
79875
112643
47111
47114
14347
178188
276493
14350
14351
14354
14355
14356
47125
14358
14359
14364
14365
14366
14369
276515
14371
14373
473126
14376
14377
14378
14379
47145
14381
440366
79919
14383
210993
79923
47156
47160
14393
14395
14396
14397
14398
211008
14402
14403
14404
14405
14406
79940
309314
14413
47191
14427
145500
14429
14433
14435
14436
79972
702566
14439
14440
112744
374893
14447
79985
112754
211060
14453
407669
14455
407671
342137
14461
243838
14463
14464
14465
14467
211081
47241
80014
80017
407698
112788
14490
243868
47267
80035
47268
440487
367605
14507
14512
172220
211122
47286
14526
14537
14541
14544
702673
342228
14549
14550
14551
14552
80085
178396
342236
14558
14559
14564
2895
14567
14568
14575
473328
14578
637171
14580
14579
440568
80120
14587
14589
14591
47360
112903
80135
47369
14604
14606
440591
243985
14610
14611
14612
375058
14614
702743
14615
14617
14618
702746
14613
407838
669987
440613
276773
14631
14632
14633
14634
211243
407852
375089
506169
47418
244027
14651
47417
14653
14650
670020
14662
14664
